#!/usr/bin/env python3

# Напишите программу, вычисляющую площадь ромба.
# Пользователь с клавиатуры вводит длину двух его диагоналей.

d1 = int(input("Enter d1: "))
d2 = int(input("Enter d2: "))

print(f"S = { (d1 * d2) / 2}")
