# На вход программе даётся строка, состоящая из слов, разделенных пробелами.
# Напишите программу, которая подсчитывает количество слов в этой строке.

print(len(input("Введите строку: ").split()))
